= おわりに
ここまで、OS5のソースコードと、簡単にではありますが、コメンタリーを書いてみました。技術書典2というイベントを知り、同人誌を書いてみようと思い立ったのが2016年12月で、このあとがきを書いている2017年3月まで、とりあえず自分の熱意を自分なりに書いてみました。「多くの人に分かりやすい」ものにはなっていないかとも思われますが、少なくともページ数から、OSにかけた情熱が少しでも伝われば嬉しいです。

なお、本書のネタ元である"Lions' Commentary on UNIX"を、実は、読んだことがありません。。。ただし、OSの歴史を調べてみるのが好きだった時に、Lions本の存在は知っていました。「OSのソースコードを印刷して本にしよう」と思った時に、「MINIX本@<fn>{minix}」も思いついたのですが、教科書として使われるMINIX本よりも、アンダーグラウンドでこっそりとコピーされて出回っていたLions本の方が「同人誌」としての雰囲気に合う気がして、ネタ元に使わせてもらいました。
//footnote[minix][オペレーティングシステム: 設計と理論およびMINIXによる実装]
